# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [8, 3, 1]] # 0
  - [-1, 1, Conv, [16, 3, 1]] # 1
  - [-1, 1, Conv, [32, 3, 1]] # 2
  - [-1, 1, Conv, [64, 3, 1]] # 0-P1/2 (3)
  - [-1, 1, Conv, [128, 3, 1]] # 1-P2/4 (4)
  - [-1, 3, C2fADown, [128, True]] # 5
  - [-1, 1, ADown, [256]] # 3-P3/8 (6)
  - [-1, 6, C2f, [256, True]] # 7
  - [-1, 1, ADown, [512]] # 5-P4/16 (8)
  - [-1, 6, C2f, [512, True]] # 9
  - [-1, 1, ADown, [512]] # 7-P5/32 (10)
  - [-1, 3, C2f, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5]] # 9 (12)

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, ADown, [256]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, ADown, [512]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
